In [2]:
!pip3 install pymysql

Collecting pymysql
  Downloading PyMySQL-1.0.2-py3-none-any.whl (43 kB)
     |████████████████████████████████| 43 kB 4.7 MB/s eta 0:00:011
Installing collected packages: pymysql
Successfully installed pymysql-1.0.2
WARNING: You are using pip version 20.2.3; however, version 22.3 is available.
You should consider upgrading via the '/Library/Frameworks/Python.framework/Versions/3.8/bin/python3.8 -m pip install --upgrade pip' command.

In [3]:
import pymysql

import pandas as pd

In [5]:
conn=pymysql.connect(host='localhost',port=int(3306),user='root',passwd='mypassword',db='mydb')

In [9]:
booking_df=pd.read_sql_query("SELECT * FROM booking ",conn)

In [10]:
booking_df

,id,booking_ref,Location_dep,Location_arr,Vehicle_id,Driver_id,Official_id,dep_time,arr_time,dep_odo,arr_odo
0,1,23,1,2,1,1,1,2022-10-01 12:30:30,2022-10-01 11:30:30,4400,4350
1,2,24,2,1,2,2,2,2022-10-01 12:35:30,2022-10-01 10:30:30,2200,2195
2,3,25,3,2,3,3,3,2022-10-02 12:30:30,2022-10-01 09:30:30,1000,509

In [11]:
driver_df=pd.read_sql_query("SELECT * FROM driver ",conn)

In [13]:
driver_df

,id,name,license,security,language,FATL_pass,FATL_level,FATL_date,STLVT_pass,STLVT_level,STLVT_date,STLVT_corp
0,1,Nam,123456789000000000,1,ko,1,3,20220910,1,3,20220910,samsung
1,2,Lee,123456789000000001,2,ja,1,4,20220910,1,4,20220910,samsung
2,3,Kim,123456789000000002,3,en,1,5,20220910,1,5,20220910,samsung

In [14]:
location_df=pd.read_sql_query("SELECT * FROM location ",conn)

In [16]:
location_df

   locid                                        street      city     type
0      1         563, Wondang-daero, Seo-gu, Incheon\t  23090770  library
1      2  8-13, Simgok-ro 100beon-gil, Seo-gu, Incheon  23090590   school
2      3       131-24, Chamoejeon-ro, Jung-gu, Incheon  23310380   church

In [17]:
official_df=pd.read_sql_query("SELECT * FROM official ",conn)

In [18]:
official_df

   id country language   role      city      name
0   1      KR       ko  coach  23090770       Kim
1   2      JP       ja  judge  23310360  Nakamura
2   3      US       en  coach  23310110    Haword

In [23]:
vehicle_df=pd.read_sql_query("SELECT * FROM vehicle ",conn)

In [24]:
vehicle_df

   id action_type odometer finalcost     description      date
0   1           R     4350      3000  wheel repaired  20220809
1   2           M     2195      3000  wheel pressure  20220810
2   3           R      509      4000           break  20220811

In [25]:
vehicle_info_df=pd.read_sql_query("SELECT * FROM vehicle_info",conn)

In [26]:
vehicle_info_df

   Vehicle_id    regid manufac   model   color current_odo capacity
0           1  2001ABC   Volvo  XC90SE  Silver        4350        4
1           2  2006AFD     Kia      K7   Black        2195        4
2           3  2021AHR   Tesla   2020F   White         509        2

In [27]:
location_df=pd.read_sql_query("SELECT * FROM location",conn)

In [28]:
location_df

   locid                                        street      city     type
0      1         563, Wondang-daero, Seo-gu, Incheon\t  23090770  library
1      2  8-13, Simgok-ro 100beon-gil, Seo-gu, Incheon  23090590   school
2      3       131-24, Chamoejeon-ro, Jung-gu, Incheon  23310380   church